Tekla.Structures.ModelInternal.dotPointCloud_t
Struct for the PointCloud.

Tekla.Structures.ModelInternal.dotPointCloud_t.Guid
The guid.

Tekla.Structures.ModelInternal.dotPointCloud_t.OriginalPath
The point clouds path (where it originally located).

Tekla.Structures.ModelInternal.dotPointCloud_t.Url
The point clouds URL.

Tekla.Structures.ModelInternal.dotPointCloud_t.TcProjectId
The Trimble Connect project id.

Tekla.Structures.ModelInternal.dotPointCloud_t.TcPointCloudGuid
The Trimble Connect point cloud guid.

Tekla.Structures.ModelInternal.dotPointCloud_t.Name
The point clouds name. Abbreviated from the point cloud file name.

Tekla.Structures.ModelInternal.dotPointCloud_t.LocationBy
The location by value: Empty for model origin, base point guid for base point.

Tekla.Structures.ModelInternal.dotPointCloud_t.Scale
The scale.

Tekla.Structures.ModelInternal.dotPointCloud_t.OffsetX
The offset X.

Tekla.Structures.ModelInternal.dotPointCloud_t.OffsetY
The offset Y.

Tekla.Structures.ModelInternal.dotPointCloud_t.OffsetZ
The offset Z.

Tekla.Structures.ModelInternal.dotPointCloud_t.RotationZ
The rotation Z.

Tekla.Structures.ModelInternal.dotPointCloud_t.BoundingBoxMinX
The bounding box min min X.

Tekla.Structures.ModelInternal.dotPointCloud_t.BoundingBoxMinY
The bounding box min Y.

Tekla.Structures.ModelInternal.dotPointCloud_t.BoundingBoxMinZ
The bounding box min Z.

Tekla.Structures.ModelInternal.dotPointCloud_t.BoundingBoxMaxX
The bounding box min max X.

Tekla.Structures.ModelInternal.dotPointCloud_t.BoundingBoxMaxY
The bounding box max Y.

Tekla.Structures.ModelInternal.dotPointCloud_t.BoundingBoxMaxZ
The bounding box max Z.